import { PartsOfSpeachType } from '../types/types';

// TODO: удалить потом mockPartsOfSpeach и брать данные с бека
export const mockPartsOfSpeach: PartsOfSpeachType = {
  'Вводное слово': {
    items: [
      {
        text: 'Мама, *видимо,* поняла моё состояние. Она бросила шитье и задумалась. Я заметил, как слёзы выступили у неё на глазах и потекли по щекам.',
      },
      {
        text: 'День, *безусловно,* выдался очень удачным. Солнце светило ярко, и легкий ветерок приятно освежал.',
      },
      {
        text: '*К* *счастью,* экзамен прошел успешно. Все студенты, *как* *оказалось,* хорошо подготовились.',
      },
      {
        text: 'Погода, *по-видимому,* собиралась испортиться. Тяжелые тучи медленно заволакивали небо.',
      },
      {
        text: '*Честно* *говоря,* я не ожидал такого поворота событий. Ситуация, *вероятно,* требовала более тщательного анализа.',
      },
    ],
  },

  'Вводное слово2': {
    items: [
      {
        text: 'Мама, *видимо,* поняла моё состояние. Она бросила шитье и задумалась. Я заметил, как слёзы выступили у неё на глазах и потекли по щекам.',
      },
      {
        text: 'День, *безусловно,* выдался очень удачным. Солнце светило ярко, и легкий ветерок приятно освежал.',
      },
      {
        text: '*К* *счастью,* экзамен прошел успешно. Все студенты, *как* *оказалось,* хорошо подготовились.',
      },
      {
        text: 'Погода, *по-видимому,* собиралась испортиться. Тяжелые тучи медленно заволакивали небо.',
      },
      {
        text: '*Честно* *говоря,* я не ожидал такого поворота событий. Ситуация, *вероятно,* требовала более тщательного анализа.',
      },
    ],
  },
};
