export interface TipInterface {
  id: number;
  text: string;
}

export const tips: TipInterface[] = [
  {
    id: 0,
    text: 'Не ставь запятую между подлежащим и сказуемым.',
  },

  {
    id: 1,
    text: 'Не ставь запятую между подлежащим и сказуемым2.',
  },

  {
    id: 2,
    text: 'Не ставь запятую между подлежащим и сказуемым3.',
  },

  {
    id: 3,
    text: 'Не ставь запятую между подлежащим и сказуемым4.',
  },

  {
    id: 4,
    text: 'Не ставь запятую между подлежащим и сказуемым5.',
  },
];
