export interface TipInterface {
  id: number;
  text: string;
}

export const tips: TipInterface[] = [
  {
    id: 0,
    text: 'Местоимение не бывает обращением.',
  },

  {
    id: 1,
    text: 'Между подлежащим и сказуемым запятая не нужна.',
  },

  {
    id: 2,
    text: 'Причастный оборот обособляется в любом случае, если определяемое слово — местоимение.',
  },

  {
    id: 3,
    text: 'Между двумя предложениями, соединенными союзами «и»/ «или» запятая не нужна, если у них есть что-то общее.',
  },

  {
    id: 4,
    text: 'Суффиксы «-то»/ «-либо»/ «-нибудь» пишутся через дефис.',
  },

  {
    id: 5,
    text: 'Исключения, относящиеся к I спряжению, не только брить, стелить, но и зиждиться, зыбыться.',
  },

  {
    id: 6,
    text: 'В 12 задании перед НН точно не будет «И».',
  },

  {
    id: 7,
    text: 'Обессилить и обессилеть — слова, в которых «ИТЬ»/ «ЕТЬ» зависят от смысла, а не от спряжения.',
  },

  {
    id: 8,
    text: 'В инфинитиве II спряжения окончание только «ИТЬ», а остальные — в I.',
  },

  {
    id: 9,
    text: 'Уже много раз сказали, но из аниме и игр пример приводить нельзя. Приведите придуманный (из жизни).',
  },

  {
    id: 10,
    text: 'Между двумя прилагательными, зависящими от одного слова и отвечающими на один вопрос (будто однородные), запятая не нужна, если они описывают существительное по разным критериям.',
  },

  {
    id: 11,
    text: 'Прилагательное и причастие (будто однородные) и правда однородные, если зависят от одного слова и причастие расположено до прилагательного.',
  },

  {
    id: 12,
    text: 'Прилагательные точно однородные, если хотя бы одно из них — эпитет (и зависят они оба от одного слова).',
  },

  {
    id: 13,
    text: 'В I спряжении «У/Ю», а во II - «А/Я». Можно запомнить: целУЮ, милАЯ.',
  },

  {
    id: 14,
    text: '«Уж замуж невтерпеж» — три наречия-исключения, в которых после шипящего не нужен Ь. А во всех остальных нужен: наотмашь, вскачь, прочь.',
  },

  {
    id: 15,
    text: 'МучАть — это обман. Только мучИть.',
  },

  {
    id: 16,
    text: 'Любое деепричастие отвечает только на один из двух вопросов: «что делая?»/ «что сделав?».',
  },

  {
    id: 17,
    text: 'У деепричастия тоже есть определяемое слово — сказуемое. По нему можно понять, однородные ли деепричастные обороты.',
  },

  {
    id: 18,
    text: 'Наречия с приставкой «по» пишутся через дефис, если в конце у них «ому»/ «ему»/ «и (ски)». По-хорошему, по-плохому, по-русски. Остальные — слитно.',
  },

  {
    id: 19,
    text: '«Пол» пишется через дефис, если дальше слово с заглавной буквы/ буквы «Л»/ любой гласной. Юля. Пол-Москвы. Пол-лимона. Пол-яблока. Остальные — слитно.',
  },

  {
    id: 20,
    text: '«Полу» всегда слитно .',
  },

  {
    id: 21,
    text: 'Если «однако» можно заменить на «но», то запятая нужна только перед этим словом. Если нельзя — с обеих сторон.',
  },

  {
    id: 22,
    text: 'Где-то перед словом «который» будет запятая. Не факт, что она ставится сразу до.',
  },

  {
    id: 23,
    text: 'Между двумя простыми предложениями ставьте запятую, если у них нет чего-то общего.',
  },
];
