import { DictantType } from '../types/types';

// TODO: удалить потом mockDictants и брать данные с бека
export const mockDictants: DictantType[] = [
  {
    theme: 'Цы-ци',
    text: 'певц*ы*, ц*и*рк, ц*ы*ган, творц*е*, писать ц*и*фры, мудрец* *, ходить на ц*ы*почках, душистый нарц*и*сс, любимец* * публики, ц*ы*плёнок, мелкие частиц*ы*, нарисовать ц*и*ркулем, ц*и*рковое представление, красавиц*а*, ц*о*п-ц*о*п, мотоц*и*кл, ц*и*линдр, синиц*а*, умельц*а*, огурец* *, ц*и*ркач, длинные пальц*ы*‚ зимние месяц*а*‚ панц*и*рь черепахи.',
  },

  {
    theme: 'Вторая тема',
    text: 'певц*ы*, ц*и*рк, ц*и*ган, творц*е*, писать ц*и*фры, мудрец* *, ходить на ц*ы*почках, душистый нарц*и*сс, любимец* * публики, ц*ы*плёнок, мелкие частиц*ы*, нарисовать ц*и*ркулем, ц*и*рковое представление, красавиц*а*, ц*о*п-ц*о*п, мотоц*и*кл, ц*и*линдр, синиц*а*, умельц*а*, огурец* *, ц*и*ркач, длинные пальц*ы*‚ зимние месяц*а*‚ панц*и*рь черепахи.',
  },

  {
    theme: 'Тест',
    text: 'певц*ы*, ц*и*рк, ц*и*ган, творц*е*, писать ц*и*фры, мудрец* *, ходить на ц*ы*почках, душистый нарц*и*сс, любимец* * публики, ц*ы*плёнок, мелкие частиц*ы*, нарисовать ц*и*ркулем, ц*и*рковое представление, красавиц*а*, ц*о*п-ц*о*п, мотоц*и*кл, ц*и*линдр, синиц*а*, умельц*а*, огурец* *, ц*и*ркач, длинные пальц*ы*‚ зимние месяц*а*‚ панц*и*рь черепахи.',
  },
];
