import { DictantType } from '../types/types';

// TODO: удалить потом mockDictants и брать данные с бека
export const mockDictants: DictantType[] = [
  {
    theme: 'Чередующиеся',

    items: [
      {
        subtheme: 'гар – гор',
        text: 'Изг*а*рь, разг*а*р лета, заг*а*р, г*а*рь, г*о*рючее, уг*а*рный газ, г*о*ревать, ог*а*рок, приг*а*рь, выг*а*рки, пог*о*релец, приг*о*рел, заг*о*релый, г*о*релка, несг*о*раемый, разг*о*релся, г*о*рняцкий',
      },

      {
        subtheme: 'зар – зор',
        text: 'З*а*рница, з*а*ря, з*о*рька, оз*а*рение, оз*а*рять, оз*а*рённый, з*о*ревать, з*о*ри',
      },

      {
        subtheme: 'твар – твор',
        text: 'Утв*а*рь, тв*о*рить, притв*о*риться, тв*о*рительный падеж, отв*о*рить дверь, тв*о*рец, раств*о*р, раств*о*рить',
      },

      {
        subtheme: 'клан – клон',
        text: 'Скл*о*няться, накл*о*ниться, скл*о*нности, покл*о*ниться, скл*о*нение, прекл*о*нение',
      },

      {
        subtheme: 'плав – плов',
        text: 'Попл*а*вок, спл*а*вляться, пл*а*вник, пл*о*вчиха, пл*а*вучий, пл*а*вить, пл*о*вцы, пл*ы*вуны',
      },

      {
        subtheme: 'раст – рос – ращ',
        text: 'Отр*а*сль, р*о*сток, выр*о*ст, р*о*стовщик, подр*о*сток, Р*о*стов, Р*о*стислав, зар*о*сли, отр*а*слевой, подр*о*стковый, р*а*стительность, выр*о*сли, водор*о*сли, пор*о*сль',
      },

      {
        subtheme: 'лаг – лож',
        text: 'Безотл*а*гательный, отл*о*жить, анал*о*гичный, пол*а*гаться, распол*а*гаться, сл*а*гаемое, прил*а*гательное, пол*а*гается, предпол*а*гать, предл*а*гать, сл*о*жение, предраспол*о*жить, прил*о*жить, изл*о*жить, выл*о*жить, предпол*о*жение',
      },

      {
        subtheme: 'кас – кос',
        text: 'К*а*саться, иск*о*са, неук*о*снительно, к*о*снуться, к*а*сательная, соприк*а*саться, неприк*а*саемый, соприк*о*снувшись, к*а*сание',
      },

      {
        subtheme: 'скак – скоч',
        text: 'Выск*о*чка, приск*а*кал, ск*а*чу, подск*о*чить, выск*о*чить, ск*а*кать, переск*о*чить, вск*о*чил, проск*о*чить, ск*а*чок, заск*о*чили',
      },

      {
        subtheme: 'равн – ровн',
        text: 'Ур*а*внять в правах, ср*а*внить, пор*о*вну, выр*о*внять поверхность, ур*а*внение, разр*а*внять землю, ср*а*внять счёт, р*о*внять грядку, зар*о*внять яму, р*а*вняется',
      },

      {
        subtheme: 'мак – мок',
        text: 'Непром*о*каемый, нам*о*кать, вым*о*кание, вым*о*кнуть под дождём, м*а*кнуть, пром*о*кнуть салфеткой, пром*о*кашка, обм*а*кни перо, обм*а*кнуть кисточку, м*а*кать в краску',
      },

      {
        subtheme: 'чет – чит',
        text: 'Поч*и*татель таланта, словосоч*е*тание, рассч*и*тать, несоч*е*тающиеся, расч*ё*тливый, поч*и*тать старость, сч*и*тать информацию, бракосоч*е*тание, соч*е*тать, соч*е*тание, выч*и*тать в уме, выч*е*т',
      },

      {
        subtheme: 'бер – бир',
        text: 'Проб*и*раться, соб*е*рёт, соб*е*рёшь, выб*и*рать, изб*и*ратель, подб*е*рёт, уб*е*ру, сб*е*регать, заб*е*ру, сб*е*режения',
      },

      {
        subtheme: 'дер – дир',
        text: 'Сд*и*рать, зад*и*рать, обд*и*рать, разд*и*раемый, зад*и*рается, прид*е*ржать, не прид*е*рёшься',
      },

      {
        subtheme: 'мер – мир',
        text: 'Зам*е*реть, зам*и*рающий, зам*и*рать, ум*и*ротворение, изм*е*рять',
      },

      {
        subtheme: 'пер – пир',
        text: 'Зап*е*реться, подп*е*реть, оп*е*реться, отп*и*рается, оп*и*раться, зап*е*реть, зап*и*рать, оп*и*раясь, вып*и*рающий, зап*и*рает',
      },

      {
        subtheme: 'тер – тир',
        text: 'Выт*е*рли, выт*и*рать, выт*е*реть, прот*е*реть, пот*и*рать руки, выт*е*ртый, раст*е*реть',
      },

      {
        subtheme: 'жег – жиг',
        text: 'Обж*и*гаться, заж*е*гший, обж*и*гающий, обж*и*гаю, выж*е*гший, заж*и*гать, подж*и*гать, подж*и*гатель',
      },

      {
        subtheme: 'блест – блист',
        text: 'Бл*е*стящий, бл*е*стеть, бл*и*стательный, забл*и*ставший, отбл*и*ставший, бл*е*стяще, бл*е*стит, забл*е*стел, бл*и*стать',
      },

      {
        subtheme: 'стел – стил',
        text: 'Заст*е*лить, расст*и*лать, выст*е*лить, расст*и*лается, расст*и*лающийся, заст*и*лать, расст*и*латься, пост*е*лить, ст*е*лить',
      },

      {
        subtheme: 'им – ин – ем – ен',
        text: 'Приж*и*мать, зан*и*маться, сж*и*маться, зан*и*мательный, отж*и*мать, заж*и*мать, вн*и*мательный, пон*и*мание, прин*и*мать, разж*и*мать, подн*и*мая, вн*и*мание, обн*и*мать, вын*и*мать, пож*и*мающий, приподн*и*мать, пож*и*мать, отн*и*мать',
      },

      {
        subtheme: 'Все чередующиеся',
        text: 'Изг*а*рь, разг*а*р лета, заг*а*р, г*а*рь, г*о*рючее, уг*а*рный газ, г*о*ревать, ог*а*рок, приг*а*рь, выг*а*рки, пог*о*релец, приг*о*рел, заг*о*релый, г*о*релка, несг*о*раемый, разг*о*релся, г*о*рняцкий, З*а*рница, з*а*ря, з*о*рька, оз*а*рение, оз*а*рять, оз*а*рённый, з*о*ревать, з*о*ри, Утв*а*рь, тв*о*рить, притв*о*риться, тв*о*рительный падеж, отв*о*рить дверь, тв*о*рец, раств*о*р, раств*о*рить, Скл*о*няться, накл*о*ниться, скл*о*нности, покл*о*ниться, скл*о*нение, прекл*о*нение, Попл*а*вок, спл*а*вляться, пл*а*вник, пл*о*вчиха, пл*а*вучий, пл*а*вить, пл*о*вцы, пл*ы*вуны, Отр*а*сль, р*о*сток, выр*о*ст, р*о*стовщик, подр*о*сток, Р*о*стов, Р*о*стислав, зар*о*сли, отр*а*слевой, подр*о*стковый, р*а*стительность, выр*о*сли, водор*о*сли, пор*о*сль, Безотл*а*гательный, отл*о*жить, анал*о*гичный, пол*а*гаться, распол*а*гаться, сл*а*гаемое, прил*а*гательное, пол*а*гается, предпол*а*гать, предл*а*гать, сл*о*жение, предраспол*о*жить, прил*о*жить, изл*о*жить, выл*о*жить, предпол*о*жение, К*а*саться, иск*о*са, неук*о*снительно, к*о*снуться, к*а*сательная, соприк*а*саться, неприк*а*саемый, соприк*о*снувшись, к*а*сание, Выск*о*чка, приск*а*кал, ск*а*чу, подск*о*чить, выск*о*чить, ск*а*кать, переск*о*чить, вск*о*чил, проск*о*чить, ск*а*чок, заск*о*чили, Ур*а*внять в правах, ср*а*внить, пор*о*вну, выр*о*внять поверхность, ур*а*внение, разр*а*внять землю, ср*а*внять счёт, р*о*внять грядку, зар*о*внять яму, р*а*вняется, Непром*о*каемый, нам*о*кать, вым*о*кание, вым*о*кнуть под дождём, м*а*кнуть, пром*о*кнуть салфеткой, пром*о*кашка, обм*а*кни перо, обм*а*кнуть кисточку, м*а*кать в краску, Поч*и*татель таланта, словосоч*е*тание, рассч*и*тать, несоч*е*тающиеся, расч*ё*тливый, поч*и*тать старость, сч*и*тать информацию, бракосоч*е*тание, соч*е*тать, соч*е*тание, выч*и*тать в уме, выч*е*т, Проб*и*раться, соб*е*рёт, соб*е*рёшь, выб*и*рать, изб*и*ратель, подб*е*рёт, уб*е*ру, сб*е*регать, заб*е*ру, сб*е*режения, Сд*и*рать, зад*и*рать, обд*и*рать, разд*и*раемый, зад*и*рается, прид*е*ржать, не прид*е*рёшься, Зам*е*реть, зам*и*рающий, зам*и*рать, ум*и*ротворение, изм*е*рять, Зап*е*реться, подп*е*реть, оп*е*реться, отп*и*рается, оп*и*раться, зап*е*реть, зап*и*рать, оп*и*раясь, вып*и*рающий, зап*и*рает, Выт*е*рли, выт*и*рать, выт*е*реть, прот*е*реть, пот*и*рать руки, выт*е*ртый, раст*е*реть, Обж*и*гаться, заж*е*гший, обж*и*гающий, обж*и*гаю, выж*е*гший, заж*и*гать, подж*и*гать, подж*и*гатель, Бл*е*стящий, бл*е*стеть, бл*и*стательный, забл*и*ставший, отбл*и*ставший, бл*е*стяще, бл*е*стит, забл*е*стел, бл*и*стать, Заст*е*лить, расст*и*лать, выст*е*лить, расст*и*лается, расст*и*лающийся, заст*и*лать, расст*и*латься, пост*е*лить, ст*е*лить, Приж*и*мать, зан*и*маться, сж*и*маться, зан*и*мательный, отж*и*мать, заж*и*мать, вн*и*мательный, пон*и*мание, прин*и*мать, разж*и*мать, подн*и*мая, вн*и*мание, обн*и*мать, вын*и*мать, пож*и*мающий, приподн*и*мать, пож*и*мать, отн*и*мать',
      },
    ],
  },
];
