import type { Preview } from '@storybook/react';

import { StoreDecorator } from './decorators/StoreDecorator';
import { RouterDecorator } from './decorators/RouterDecorator';
import { StyleDecorator } from './decorators/StyleDecorator';
import { RTKApiURL } from '../src/shared/api/RTKApi/api';

const preview: Preview = {
  parameters: {
    controls: {
      matchers: {
        color: /(background|color)$/i,
        date: /Date$/i,
      },
    },

    mockData: [
      {
        url: `${RTKApiURL}/dictations`,
        method: 'GET',
        status: 200,
        response: [
          {
            theme: 'ци-цы',
            items: [
              {
                subtheme: 'ци-цы',
                text: 'акц*и*онер, аукц*и*он, дефиц*и*т, певц*ы*, рац*и*онально, мотоц*и*кл, улиц*ы*, рац*и*я, ц*и*ркуль, ц*ы*гане, ц*и*тадель, границ*ы*, рубц*ы*, ц*и*фры, панц*и*рь, делегац*и*я, выц*ы*ганить, огурц*ы*, ц*ы*почка, ресниц*ы*, ц*ы*ц, ликвидац*и*я, ц*и*клон, ц*ы*кнуть, спец*и*и, ц*и*линдр, ц*ы*плёнок, пунктуац*и*я, ц*ы*почки',
              },
              {
                subtheme: 'ци-цы 2',
                text: 'акц*и*онер, аукц*и*он, дефиц*и*т, певц*ы*, рац*и*онально, мотоц*и*кл, улиц*ы*, рац*и*я, ц*и*ркуль, ц*ы*гане, ц*и*тадель, границ*ы*, рубц*ы*, ц*и*фры, панц*и*рь, делегац*и*я, выц*ы*ганить, огурц*ы*, ц*ы*почка, ресниц*ы*, ц*ы*ц, ликвидац*и*я, ц*и*клон, ц*ы*кнуть, спец*и*и, ц*и*линдр, ц*ы*плёнок, пунктуац*и*я, ц*ы*почки',
              },
            ],
          },
          {
            theme: 'частицы',
            items: [
              {
                subtheme: 'не-ни',
                text: 'Они н*е* единственные, кто умеет менять облик. \r\nДеревья н*е* шевелились н*и* листиком. \r\nТеперь никому н*е* остановить осеннего пожара.\r\nКак н*и* старайся, свой локоть н*е* укусишь.\r\nКатюша, н*е* смея н*и* ему, н*и* даже себе признаться в этом, влюбилась в него.\r\nН*и* с чем н*е* спутаешь жёлтые корзинки её цветка.\r\nКак бы н*и* менялось общество, ценности будут те же.\r\nН*е* научился н*и* читать, н*и* писать.\r\nН*и* рыба н*и* мясо.\r\nНо сколько н*и* старался — и потом н*е* мог узнать этого.\r\nЯ не мог н*е* остановиться.\r\nВокруг н*и* души.\r\nН*е* для кого мне стараться.\r\nЧто бы н*и* случилось, нельзя сдаваться.\r\nДа как н*и* расписывай, расписать нельзя так, чтобы вы поняли, какая она была.\r\nЯ н*е* спрашивал н*и* ее, н*и* себя даже о том, любит ли она меня.',
              },
            ],
          },
        ],
      },

      {
        url: `${RTKApiURL}/tests`,
        method: 'GET',
        status: 200,
        response: [
          {
            id: 4,
            questions: [
              {
                id: 5,
                answers: [
                  {
                    id: 9,
                    text: '1 склонение',
                    is_correct: false,
                    question: 5,
                  },
                  {
                    id: 10,
                    text: '2 склонение',
                    is_correct: true,
                    question: 5,
                  },
                  {
                    id: 11,
                    text: '3 склонение',
                    is_correct: false,
                    question: 5,
                  },
                  {
                    id: 12,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 5,
                  },
                ],
                text: '"В АКВАРИУМЕ"',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 6,
                answers: [
                  {
                    id: 13,
                    text: '1 склонение',
                    is_correct: false,
                    question: 6,
                  },
                  {
                    id: 14,
                    text: '2 склонение',
                    is_correct: true,
                    question: 6,
                  },
                  {
                    id: 15,
                    text: '3 склонение',
                    is_correct: false,
                    question: 6,
                  },
                  {
                    id: 16,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 6,
                  },
                ],
                text: 'КАМЫШ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 7,
                answers: [
                  {
                    id: 17,
                    text: '1 склонение',
                    is_correct: true,
                    question: 7,
                  },
                  {
                    id: 18,
                    text: '2 склонение',
                    is_correct: false,
                    question: 7,
                  },
                  {
                    id: 19,
                    text: '3 склонение',
                    is_correct: false,
                    question: 7,
                  },
                  {
                    id: 20,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 7,
                  },
                ],
                text: 'РОЩА',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 8,
                answers: [
                  {
                    id: 21,
                    text: '1 склонение',
                    is_correct: false,
                    question: 8,
                  },
                  {
                    id: 22,
                    text: '2 склонение',
                    is_correct: true,
                    question: 8,
                  },
                  {
                    id: 23,
                    text: '3 склонение',
                    is_correct: false,
                    question: 8,
                  },
                  {
                    id: 24,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 8,
                  },
                ],
                text: 'В ГЕРБАРИИ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 9,
                answers: [
                  {
                    id: 25,
                    text: '1 склонение',
                    is_correct: false,
                    question: 9,
                  },
                  {
                    id: 26,
                    text: '2 склонение',
                    is_correct: true,
                    question: 9,
                  },
                  {
                    id: 27,
                    text: '3 склонение',
                    is_correct: false,
                    question: 9,
                  },
                  {
                    id: 28,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 9,
                  },
                ],
                text: 'О ТЮЛЕНЕ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 10,
                answers: [
                  {
                    id: 29,
                    text: '1 склонение',
                    is_correct: false,
                    question: 10,
                  },
                  {
                    id: 30,
                    text: '2 склонение',
                    is_correct: false,
                    question: 10,
                  },
                  {
                    id: 31,
                    text: '3 склонение',
                    is_correct: false,
                    question: 10,
                  },
                  {
                    id: 32,
                    text: 'разносклоняемое',
                    is_correct: true,
                    question: 10,
                  },
                ],
                text: 'В ПЛАМЕНИ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 11,
                answers: [
                  {
                    id: 33,
                    text: '1 склонение',
                    is_correct: false,
                    question: 11,
                  },
                  {
                    id: 34,
                    text: '2 склонение',
                    is_correct: false,
                    question: 11,
                  },
                  {
                    id: 35,
                    text: '3 склонение',
                    is_correct: false,
                    question: 11,
                  },
                  {
                    id: 36,
                    text: 'разносклоняемое',
                    is_correct: true,
                    question: 11,
                  },
                ],
                text: 'О ПЛЕМЕНИ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 12,
                answers: [
                  {
                    id: 37,
                    text: '1 склонение',
                    is_correct: false,
                    question: 12,
                  },
                  {
                    id: 38,
                    text: '2 склонение',
                    is_correct: false,
                    question: 12,
                  },
                  {
                    id: 39,
                    text: '3 склонение',
                    is_correct: true,
                    question: 12,
                  },
                  {
                    id: 40,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 12,
                  },
                ],
                text: 'К ПРИСТАНИ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 13,
                answers: [
                  {
                    id: 41,
                    text: '1 склонение',
                    is_correct: true,
                    question: 13,
                  },
                  {
                    id: 42,
                    text: '2 склонение',
                    is_correct: false,
                    question: 13,
                  },
                  {
                    id: 43,
                    text: '3 склонение',
                    is_correct: false,
                    question: 13,
                  },
                  {
                    id: 44,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 13,
                  },
                ],
                text: 'МЫ НА ДАЧЕ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 14,
                answers: [
                  {
                    id: 45,
                    text: '1 склонение',
                    is_correct: true,
                    question: 14,
                  },
                  {
                    id: 46,
                    text: '2 склонение',
                    is_correct: false,
                    question: 14,
                  },
                  {
                    id: 47,
                    text: '3 склонение',
                    is_correct: false,
                    question: 14,
                  },
                  {
                    id: 48,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 14,
                  },
                ],
                text: '(много) ЗАДАЧ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 15,
                answers: [
                  {
                    id: 49,
                    text: '1 склонение',
                    is_correct: true,
                    question: 15,
                  },
                  {
                    id: 50,
                    text: '2 склонение',
                    is_correct: false,
                    question: 15,
                  },
                  {
                    id: 51,
                    text: '3 склонение',
                    is_correct: false,
                    question: 15,
                  },
                  {
                    id: 52,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 15,
                  },
                ],
                text: '(идти) ПО АЛЛЕЕ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 16,
                answers: [
                  {
                    id: 53,
                    text: '1 склонение',
                    is_correct: true,
                    question: 16,
                  },
                  {
                    id: 54,
                    text: '2 склонение',
                    is_correct: false,
                    question: 16,
                  },
                  {
                    id: 55,
                    text: '3 склонение',
                    is_correct: false,
                    question: 16,
                  },
                  {
                    id: 56,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 16,
                  },
                ],
                text: '(задание по) ИСТОРИИ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 17,
                answers: [
                  {
                    id: 57,
                    text: '1 склонение',
                    is_correct: false,
                    question: 17,
                  },
                  {
                    id: 58,
                    text: '2 склонение',
                    is_correct: false,
                    question: 17,
                  },
                  {
                    id: 59,
                    text: '3 склонение',
                    is_correct: true,
                    question: 17,
                  },
                  {
                    id: 60,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 17,
                  },
                ],
                text: 'ГОРЕЧЬ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 18,
                answers: [
                  {
                    id: 61,
                    text: '1 склонение',
                    is_correct: false,
                    question: 18,
                  },
                  {
                    id: 62,
                    text: '2 склонение',
                    is_correct: true,
                    question: 18,
                  },
                  {
                    id: 63,
                    text: '3 склонение',
                    is_correct: false,
                    question: 18,
                  },
                  {
                    id: 64,
                    text: 'разносклоняемое',
                    is_correct: false,
                    question: 18,
                  },
                ],
                text: 'УЧИЛИЩ',
                has_one_correct_answer: true,
                test: 4,
              },
              {
                id: 19,
                answers: [
                  {
                    id: 65,
                    text: '1 склонение',
                    is_correct: false,
                    question: 19,
                  },
                  {
                    id: 66,
                    text: '2 склонение',
                    is_correct: false,
                    question: 19,
                  },
                  {
                    id: 67,
                    text: '3 склонение',
                    is_correct: false,
                    question: 19,
                  },
                  {
                    id: 68,
                    text: 'разносклоняемое',
                    is_correct: true,
                    question: 19,
                  },
                ],
                text: 'ВО ВРЕМЕНИ',
                has_one_correct_answer: true,
                test: 4,
              },
            ],
            title: 'склонения',
          },
        ],
      },

      {
        url: `${RTKApiURL}/part_of_speechs`,
        method: 'GET',
        status: 200,
        response: [
          {
            theme: 'фразеологизмы',
            items: [
              {
                text: 'Он нехотя взял карточку, и *глаза* у него *поехали* *на* *лоб* .',
              },
              {
                text: 'Родители сами понимали, что *по* их *стопам* я не пойду, и даже не намекали на это.',
              },
              {
                text: 'Я понимал: даже просто войти в здание, где она находится, я не смогу,  *духу* *не* *хватит* .',
              },
              {
                text: 'Он не растерялся, не *пал* *духом* , он не просил милостыню, как просят калеки, он работал как мог.',
              },
              {
                text: 'Зрители смеются *от* *всей* *души* , хлопают',
              },
              {
                text: '*Слёзы* *подступили* *к* *горлу* , стали душить, но он сдержался  — не заплакал',
              },
              {
                text: 'Мать запретила  — с ними домой *ни* *ногой*',
              },
              {
                text: 'Ему казалось, что любые удачи приходят к людям как бы *за* его *счёт*',
              },
              {
                text: 'Зависть, в которой кроется исток многих человеческих слабостей и пороков, не *оставляла* Сеньку *в* *покое*',
              },
              {
                text: 'Эти пуговицы *бросились* мне *в* *глаза* прежде всего: у всех были железные пуговицы со звёздочкой, а у Витьки Борецкого  — с якорями.',
              },
              {
                text: '…я ненавидящим шёпотом возразил, что *нежности* *телячьи* эти нам не ко двору, что уж коли деньги принесла, так пусть сама и платит.',
              },
              {
                text: 'На дворе ко мне подошли несколько товарищей и один спросил, что это за *шут* *гороховый* в юбке, с которым я только что беседовал.',
              },
              {
                text: 'И *лезут* *в* *голову* мысли о ребятах, оставшихся на плацдарме.',
              },
              {
                text: 'Зажмурюсь  — и опять всё это *стоит* *перед* *глазами* : землянка связистов, в которую попала бомба, дорога в лесу и чёрные высоты, занятые немцами...',
              },
              {
                text: 'И я сначала в садике, а потом в школе несла *тяжкий* *крест* отцовской несуразности.',
              },
              {
                text: 'Я готова была *провалиться* *сквозь* *землю* от стыда и вела себя подчёркнуто холодно, показывая своим видом, что этот нелепый человек с красным носом не имеет ко мне никакого отношения',
              },
              {
                text: 'Шёпотом он рассказал маме, что дошёл до райцентра, *поднял* всех *на* *ноги* и вернулся с вездеходом.',
              },
              {
                text: 'Остановившись на пороге, Динка *не* могла *оторвать* *глаз* от этого портрета',
              },
              {
                text: '*Не* *чувствуя* под собой *ног* и не зная, что ей делать, она жалостно попросила:  — Сыграйте, Яков Ильич',
              },
              {
                text: 'Нельзя же заново изобретать самолёт, если его давно изобрели, или открывать новые страны, если всё уже пройдено *вдоль* *и* *поперёк* !',
              },
              {
                text: 'Но однажды Пашкин отец в сумерках наступил на рычаг, и его окатило *с* *головы* *до* *пят*',
              },
              {
                text: 'А затем со слезами Митя требовал вернуть ему былое доверие ради святой дружбы, что «больше нас самих», и пытался влепить мне *иудин* *поцелуй*',
              },
              {
                text: 'Но Митя не только внешне походил на девочку  — слабодушный, чувствительный, слезливый, хотя и способный к истерическим вспышкам ярости, и на него *рука* *не* *поднималась*',
              },
              {
                text: 'Весь вагон радовался моей покупке, и на полчаса я стал *центром* *внимания*',
              },
              {
                text: 'Я был *на* *седьмом* *небе* от счастья и засыпал с книгой в руках',
              },
              {
                text: 'Я никогда больше *пальцем* *не* *тронул* Оську, как бы он ни задирался, а это случалось порой в первые годы нашей так сложно начавшейся дружбы.',
              },
              {
                text: 'И это открытое движение доброты, нежности и доверия *перевернуло* во мне *душу* ...',
              },
              {
                text: 'Это всё *приходило* мне *в* *голову*',
              },
              {
                text: 'Смеялись *во* *весь* *голос* и разговаривали',
              },
              {
                text: '— Вот что значит – друзья!  — сказал Пашка *во* *весь* *голос* и слегка качнул загипсованной рукой',
              },
              {
                text: '— Ну, дают!  — разозлился Пашка.  — Венька, скажи Антуану, что *всё* *обойдётся* : заберут они своё заявление *как* *миленькие* !',
              },
              {
                text: 'В третью военную осень после уроков Анна Николаевна не отпустила нас по домам, а раздала узкие полоски бумаги, на которых под жирной фиолетовой печатью  — всё *честь* *по* *чести* !  — было написано, что такой-то или такая-то действительно учится во втором классе девятой начальной школы.',
              },
              {
                text: 'Выходило, что книжки читать будем мы и терять, если доведётся, тоже будем их мы, а вот мамам *ни* *много* *ни* *мало* придётся страдать из-за этого, будто им и так не достаётся.',
              },
              {
                text: 'На даче, *в* *двух* *шагах* от застеклённой веранды, висит удобный, глубокий гамак, в который так хочется поскорее залезть, что он мне снится по ночам  — в виде сказочной ладьи, плывущей над сосновым лесом',
              },
              {
                text: 'Она наклоняется, берёт платьице, перебирает его руками, а сама смотрит куда-то в сторону, в одну точку, и лицо у нее напряжённое и печальное, что мне становится *не* *по* *себе*',
              },
              {
                text: 'Позднего ребёнка *ждут* *не* *дождутся* и, когда наконец дожидаются, начинают проявлять к нему такую любовь, такое внимание, что ему хочется сбежать *на* *край* *света*',
              },
              {
                text: 'Мама на следующий же день потащила Веньку в магазин, где они купили обалденный, как ему тогда в горячке показалось, бежевый пиджак, в котором *бросалась* *в* *глаза* тонкая коричневая клетка',
              },
              {
                text: '— Тётя Нина отдала. Витальке стал маловат, а тебе будет *в* *самый* *раз* .',
              },
              {
                text: 'Оксану *как* *ветром* *сдуло* вместе с её неудовольствием, и через секунду послышался её голос  — тугой и звонкий, как струя, пущенная под напором',
              },
              {
                text: 'Чего она мне *нервы* *мотает* ?',
              },
              {
                text: 'Его и маленькую сестрёнку воспитывала мать, истеричная, крикливая женщина, которая *то* *и* *дело* приходила в школу, чтобы разобраться с обидчиками её детей',
              },
              {
                text: 'А он, готовый от стыда *провалиться* *сквозь* *землю* , густо покраснел, торопливо поднял её и, погладив обложку, отодвинул от себя, словно извиняясь за то, что посмел к ней прикоснуться',
              },
              {
                text: 'Однажды я *на* *своей* *шкуре* *испытал* , насколько непримиримым может быть мягкий, покладистый Павлик',
              },
              {
                text: '*На* *первый* *взгляд* так оно и было',
              },
              {
                text: 'Я неплохо знал немецкий, домашних заданий никогда по этому предмету не готовил, но однажды настал и мой черёд, когда Елена Францевна *ни* *с* *того* *ни* *с* *сего* вызвала меня к доске, будто самого рядового ученика, и велела читать стихотворение',
              },
              {
                text: 'Нам было лет по четырнадцать, когда я *на* *своей* *шкуре* *испытал*, насколько непримиримым может быть мягкий, покладистый Павлик.',
              },
              {
                text: '*В* *первую* *голову*  — за ум и отличные успехи',
              },
              {
                text: 'Версию эту Сергей полностью не отрицал, она всё-таки утешала его, но *цену* *себе* он *знал* точную',
              },
              {
                text: 'По поведению росомахи служители зоопарка *с* *первого* *взгляда* поняли, что у неё, наверно, скоро должны родиться детёныши и она ищет место для логова',
              },
              {
                text: 'Она *изо* *всех* *сил* кидалась то на одного, то на другого волка, увёртывалась от их укусов, бросалась опять, не давая им подойти к детям',
              },
              {
                text: 'Выбежав на улицу, *перевёл* *дух* и нашёл на фасаде дома Юркины окна',
              },
              {
                text: '— Вот приедет моя жена, и всё *будет* *в* *порядке*',
              },
              {
                text: 'Но я даже *не* *подал* *виду*',
              },
              {
                text: 'Только ты ей, смотри, об этом *ни* *гугу* !',
              },
              {
                text: 'Но Васятка не слышал, он отмахивался от пчёл и кричал *во* *весь* *голос*',
              },
              {
                text: 'Что-то здесь пчёл *видимо-невидимо*',
              },
              {
                text: 'Я с кличем «ура» *во* *весь* *дух* рванулся ему навстречу',
              },
              {
                text: 'Её голос понравился Урсу, пришёлся ему *по* *душе*',
              },
              {
                text: 'Он с одного жулика сорвал штаны и покусал его *будь* *здоров*',
              },
            ],
          },
          {
            theme: 'существительное',
            items: [
              {
                text: '*Натуралистов* всегда поражала *особенность* *охоты* *сов* : *птицы* охотятся в *темноте* на мелких *грызунов* и вылавливают их немало  — десятки за *ночь*',
              },
              {
                text: 'Может быть, *совы* разыскивают *добычу* с помощью  какого-нибудь  необычного *чувства* ?',
              },
            ],
          },
        ],
      },
    ],
  },

  decorators: [StyleDecorator, StoreDecorator, RouterDecorator],
};

export default preview;
